# Data Cleaning & Preparation

## 7.1 
Handling Missing Data

Filling In Missing Data

## 7.2 

Data Transformation

Transforming Data Using a Function or Mapping

Replacing Values

Renaming Axis Indexes

Discretization and Binning

Detecting and Filtering Outliers

Permutation and Random Sampling

Computing Indicator/Dummy Variables


## 7.3 
String Manipulation

Regular Expressions

Vectorized String Functions in pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [44]:
# Assign a Null Value

string_data[0]=None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [45]:
# Alternate approach to assign Null Value

from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data[4] = NA  
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [31]:
data.dropna(how='all',axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

# Filling In Missing Data

In [32]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.749032 -1.619960  0.013065
1  1.229535 -0.723477 -1.153165
2 -0.197663 -0.474394  0.359053
3 -1.733755  0.275816  0.996468
4 -0.297848 -0.584549  1.683050
5  1.202945  2.560015 -0.760185
6 -0.919716  0.744275 -0.456733

In [33]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.749032       NaN       NaN
1  1.229535       NaN       NaN
2 -0.197663       NaN  0.359053
3 -1.733755       NaN  0.996468
4 -0.297848 -0.584549  1.683050
5  1.202945  2.560015 -0.760185
6 -0.919716  0.744275 -0.456733

In [34]:
df.fillna(0)

          0         1         2
0 -0.749032  0.000000  0.000000
1  1.229535  0.000000  0.000000
2 -0.197663  0.000000  0.359053
3 -1.733755  0.000000  0.996468
4 -0.297848 -0.584549  1.683050
5  1.202945  2.560015 -0.760185
6 -0.919716  0.744275 -0.456733

In [36]:
df.fillna({1:99,2:88})

          0          1          2
0 -0.749032  99.000000  88.000000
1  1.229535  99.000000  88.000000
2 -0.197663  99.000000   0.359053
3 -1.733755  99.000000   0.996468
4 -0.297848  -0.584549   1.683050
5  1.202945   2.560015  -0.760185
6 -0.919716   0.744275  -0.456733

In [38]:
# Interpolation Metods:

df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.012661  3.457913  0.544179
1  0.099852  0.087010  0.135869
2 -1.526239  1.485046  0.606607
3  1.844034  0.118986  0.993095
4  0.363338  0.836246 -0.784114
5 -0.590636  0.075328  0.056739

In [39]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.012661  3.457913  0.544179
1  0.099852  0.087010  0.135869
2 -1.526239       NaN  0.606607
3  1.844034       NaN  0.993095
4  0.363338       NaN       NaN
5 -0.590636       NaN       NaN

In [40]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.012661  3.457913  0.544179
1  0.099852  0.087010  0.135869
2 -1.526239  0.087010  0.606607
3  1.844034  0.087010  0.993095
4  0.363338  0.087010  0.993095
5 -0.590636  0.087010  0.993095

In [41]:
df.fillna(method = 'ffill',limit =2)

          0         1         2
0 -0.012661  3.457913  0.544179
1  0.099852  0.087010  0.135869
2 -1.526239  0.087010  0.606607
3  1.844034  0.087010  0.993095
4  0.363338       NaN  0.993095
5 -0.590636       NaN  0.993095

In [42]:
# Fill the missing values with mean()

data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
# check if there are row level dups (this approach is good only if we have less rows of data)
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
# drop the row level dups
    
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
# remove the row level dups based on specific column

data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
# remove the dups from end and based on 2 columns

data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [53]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 
                  'honey ham': 'pig', 'nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [56]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [57]:
data['animal'] = lowercased.map(meat_to_animal)
data  # below we can see 'Pastrami','Bacon' etc is still caps only i.e we created the lowercased just to match food name with
        # meat to animal mapping.

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [61]:
# alternate shortcut approach without creating an additional step of 'lowercased':

data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Values

In [62]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [63]:
# Replace for single entry:

data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [64]:
# Replace for multiple entries: 

data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [67]:
# Replace with diff value for diff entry:

data.replace([-999,-1000],[np.nan,0])  #or data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [68]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
# Define a func which converts to upper case
transform = lambda x:x.upper()
transform

In [86]:
data.index.map(transform)   # here result got truncated, looks like since Ohio was 4 characters it truncated other also.

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [87]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [92]:
# Renaming the Index Name and Column Name:
# Eg1: 

data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [95]:
# Eg2:

data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

# Discretization and Binning

In [106]:
# Define the data

ages = [18,20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[18, 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [107]:
# Define the bin

bins = [18, 25, 35, 60, 100]
bins

[18, 25, 35, 60, 100]

In [108]:
# apply the bin on data

cats = pd.cut(ages, bins)
cats

[NaN, (18.0, 25.0], (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [109]:
cats.codes  # 0 means 1st bucket i.e (18,25], 1 means 2nd bucket i.e (25,35] etc

array([-1,  0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1], dtype=int8)

In [110]:
# distinct buckets list

cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [111]:
# how many items are tagged to each bucket

pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [112]:
# Change which side is open and which side is closed

pd.cut(ages, [18, 26, 36, 61, 100], right=False)  # in result we can see now it beings with '[' instead of ')'

[[18, 26), [18, 26), [18, 26), [18, 26), [26, 36), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 13
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [114]:
# Give some meaningful name/label for each bin

group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

cat2 = pd.cut(ages,bins,labels=group_names )
cat2

[NaN, Youth, Youth, Youth, YoungAdult, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [115]:
pd.value_counts(cat2)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [116]:
# If you pass an integer number of bins to cut instead of explicit bin edges

data = np.random.rand(20)

pd.cut(data, 4, precision=2)

[(0.011, 0.22], (0.44, 0.65], (0.44, 0.65], (0.44, 0.65], (0.44, 0.65], ..., (0.44, 0.65], (0.65, 0.86], (0.22, 0.44], (0.65, 0.86], (0.011, 0.22]]
Length: 20
Categories (4, interval[float64]): [(0.011, 0.22] < (0.22, 0.44] < (0.44, 0.65] < (0.65, 0.86]]

In [121]:
# QCUT - To obtain roughly equal-size bins

data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-3.102, -0.615], (0.021, 0.703], (-0.615, 0.021], (0.703, 3.456], (-0.615, 0.021], ..., (0.703, 3.456], (-3.102, -0.615], (-3.102, -0.615], (-3.102, -0.615], (-3.102, -0.615]]
Length: 1000
Categories (4, interval[float64]): [(-3.102, -0.615] < (-0.615, 0.021] < (0.021, 0.703] < (0.703, 3.456]]

In [122]:
pd.value_counts(cats)

(0.703, 3.456]      250
(0.021, 0.703]      250
(-0.615, 0.021]     250
(-3.102, -0.615]    250
dtype: int64

In [131]:
# pass your own quantiles 

cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats

[(-1.247, 0.021], (0.021, 1.289], (-1.247, 0.021], (0.021, 1.289], (-1.247, 0.021], ..., (0.021, 1.289], (-1.247, 0.021], (-1.247, 0.021], (-3.102, -1.247], (-1.247, 0.021]]
Length: 1000
Categories (4, interval[float64]): [(-3.102, -1.247] < (-1.247, 0.021] < (0.021, 1.289] < (1.289, 3.456]]

In [132]:
pd.value_counts(cats)

(0.021, 1.289]      400
(-1.247, 0.021]     400
(1.289, 3.456]      100
(-3.102, -1.247]    100
dtype: int64

# Detecting and Filtering Outliers

In [133]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -1.663009 -0.536495  0.586039  1.016953
1   -0.891804 -1.179145 -0.278929 -0.473044
2   -1.272391 -1.499494 -0.532487 -1.509835
3   -1.278414  0.520382 -0.160062  1.150271
4    0.884718 -0.298734 -1.624654 -0.777775
..        ...       ...       ...       ...
995 -1.042509 -0.539367 -1.412824  1.456708
996  0.216370 -0.423425  0.194300 -0.428094
997 -1.231254 -0.049852 -0.952694  0.262598
998 -0.996377 -0.773498 -1.084874  0.348240
999 -0.516284 -0.892464 -2.057890  0.793553

[1000 rows x 4 columns]

In [134]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006666     0.004358     0.041077     0.016587
std       1.013511     1.003679     1.016577     0.974933
min      -3.223893    -2.911855    -3.170640    -3.280415
25%      -0.673179    -0.680490    -0.634037    -0.617000
50%      -0.020456    -0.015882     0.033399     0.041761
75%       0.702816     0.668678     0.704873     0.682169
max       3.142247     3.354512     3.334657     2.897628

In [138]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
19  -1.102587 -0.341764  1.194316 -3.093884
125  3.002300  1.109968  0.637757 -0.950152
129 -3.121683 -0.038651 -0.651073 -2.138841
375 -3.184362  1.117380 -0.342083  0.115690
398 -0.022378  0.623550 -1.054080 -3.113883
424  0.923384  0.308679  3.036755  0.862592
559  1.000560  3.041963 -0.172984  0.789735
595  3.142247  0.342013 -0.406962 -0.621856
685 -0.388125  3.267964 -0.026892 -0.768560
711  0.885303 -0.611751  3.334657 -0.896680
731  0.150708  3.354512 -0.059096 -1.445633
762 -3.223893  0.759147  1.448109  0.198382
810  0.765651 -0.382417 -3.170640  0.046805
825 -3.067003  1.034067  0.098814 -2.613041
896  0.817603  1.303173  0.921062 -3.280415

In [139]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [140]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006214     0.003694     0.040876     0.017076
std       1.011254     1.001592     1.014912     0.973368
min      -3.000000    -2.911855    -3.000000    -3.000000
25%      -0.673179    -0.680490    -0.634037    -0.617000
50%      -0.020456    -0.015882     0.033399     0.041761
75%       0.702816     0.668678     0.704873     0.682169
max       3.000000     3.000000     3.000000     2.897628

In [142]:
np.sign(data)

       0    1    2    3
0   -1.0 -1.0  1.0  1.0
1   -1.0 -1.0 -1.0 -1.0
2   -1.0 -1.0 -1.0 -1.0
3   -1.0  1.0 -1.0  1.0
4    1.0 -1.0 -1.0 -1.0
..   ...  ...  ...  ...
995 -1.0 -1.0 -1.0  1.0
996  1.0 -1.0  1.0 -1.0
997 -1.0 -1.0 -1.0  1.0
998 -1.0 -1.0 -1.0  1.0
999 -1.0 -1.0 -1.0  1.0

[1000 rows x 4 columns]

# Permutation and Random Sampling

In [143]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [151]:
# Execute multiple times and observe that result changes for every execution

sampler = np.random.permutation(5)
sampler

array([2, 4, 3, 1, 0])

In [152]:
df.take(sampler)  # observe the index order, its same as above result. No change in Row values/column values.

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [155]:
# select a random subset 

df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [157]:
# To generate a sample with replacement (to allow repeat choices)

s = pd.Series([5, 7, -1, 6, 4])
s

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [160]:
draws = s.sample(n=10, replace=True)
draws  # below we can see same value has repeated.

0    5
4    4
0    5
2   -1
1    7
1    7
4    4
0    5
4    4
1    7
dtype: int64

# Computing Indicator/Dummy Variables

In [161]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [165]:
pd.get_dummies(df['key'])  
#column a,b,c below are the distinct values of column 'key' above. 
# in above 0th row, for key = b, data1 = 0 so in below 0th row we can see column 'a' value =0, 'b' =1 and 'c'=0

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [166]:
# In some cases, you may want to add a prefix to the columns in the indicator Data‐ Frame

df2 = pd.get_dummies(df['key'], prefix='key')
df2

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [169]:
df_with_df2 = df[['data1']].join(df2)
df_with_df2

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# 7.3 String Manipulation

In [170]:
# String Object Methods

val = 'a,b, guido'
val

'a,b, guido'

In [171]:
# A) splitting

val.split(',')  # below guido has extra space in the beginning

['a', 'b', ' guido']

In [173]:
# split is often combined with strip to trim whitespace

pieces = [x.strip() for x in val.split(',')]
pieces # below we can see spaces are removed

['a', 'b', 'guido']

In [174]:
# assign above values to variables

first, second, third = pieces

print(first, second, third)

a b guido

In [175]:
# B) concatenation:

first + '::' + second + '::' + third

'a::b::guido'

In [176]:
# Pythonic way:

'::'.join(pieces)

'a::b::guido'

In [177]:
# C) locating substrings

'guido' in val

True

In [178]:
val.index(',')  # index raises an exception if the string isn’t found (versus returning –1)

1

In [181]:
val.find(':') # find doesn't raises an exception if the string isn’t found (returns –1)

-1

In [182]:
# D) Num of Occurances:

val.count(',')

2

In [183]:
# E) Substitute occurrences of one pattern for another

val.replace(',', '::')

'a::b:: guido'

In [184]:
val.replace(',', '')

'ab guido'

# Regular Expressions

In [188]:
#Python’s built-in re module is responsible for applying regular expressions to strings; 

#The re module functions fall into three categories: pattern matching, substitution, and splitting.

In [189]:
import re

In [191]:
text = "foo bar\t baz \tqux"   # \t is tab here i.e 8 spaces
text

'foo bar\t baz \tqux'

In [193]:
# A) Split a string with a variable number of whitespace characters (tabs, spaces, and newlines)


re.split('\s+', text)  # The regex describing one or more whitespace characters is \s+

['foo', 'bar', 'baz', 'qux']

In [194]:
# B) For better performance You can compile the regex yourself

regex = re.compile('\s+')
regex

re.compile(r'\s+', re.UNICODE)

In [195]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [196]:
# C) get a list of all patterns matching the regex

regex.findall(text)

[' ', '\t ', ' \t']

In [197]:
# D) Findall, Search, Match, Sub

text = """Dave dave@google.com Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

text

'Dave dave@google.com Steve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [198]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'  #regexp@regex.regex
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [200]:
regex = re.compile(pattern, flags=re.IGNORECASE)   # re.IGNORECASE makes the regex case-insensitive
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [201]:
# 'findall' returns all matches in a string
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [202]:
# 'search' returns only the first match

m = regex.search(text)
m # Dave dave@google.com  so starts at 5th position and ends at 19th position (counting starts from 0)

In [208]:
text[m.start():m.end()]  #extract the content from 5th to 19th position ie above identified span

'dave@google.com'

In [210]:
# 'match' only matches at the beginning of the string

print(regex.match(text))

None

In [212]:
# 'sub' will return a new string with occurrences of the pattern replaced by the a new string:

print(regex.sub('REDACTED', text))

Dave REDACTED Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [213]:
# E) Suppose you wanted to find email addresses and 
# simultaneously segment each address into its three components: username, domain name, and domain suffix.

pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'  # (regexp)@(regex).(regex)

pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [214]:
# compile it for better performance
regex = re.compile(pattern, flags=re.IGNORECASE)

In [215]:
m = regex.match('wesm@bright.net')
m

In [216]:
m.groups()

('wesm', 'bright', 'net')

In [217]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [220]:
# sub also has access to groups in each match using special symbols like \1 and \2 etc 

print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

# Vectorized String Functions in pandas

In [234]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [235]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [236]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [237]:
# Series has array-oriented methods for string opera‐tions that skip NA values. 

data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [238]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [239]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [240]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [242]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object